package by.tms.myproject.lessons01.classwork;

/*Написать программу, в которой задан один целочисленный параметр
        и программа рассчитывает значение,
        равное этому параметру, возведенному в куб*/

public class СubeNumber {

    public static void main(String[] args) {
        int number = 10;
        System.out.println(number*number*number);
    }
}
