package by.tms.myproject.lessons10.homework;

//  Написать программу, преобразующую строку, содержащую число в римском формате, в число в арабском формате.
//  Границы чисел: от 1 до 3999. Предусмотреть случай, когда меньший символ идёт перед большим:
//  Например CM == 900; IX == 9.
//  Соответствие:
//  M 1000
//  D 500
//  C 100
//  L 50
//  X 10
//  V 5
//  I 1


public class Task02 {

    public static void main(String[] args) {
//        int[] numer = {1000, 500, 100, 50, 10, 5, 1};
//        String[] liter = {M, D, C, L, X, V, I};I
    }

}
